{
    "version": "https://jsonfeed.org/version/1",
    "title": "Neorotribe",
    "description": "",
    "home_page_url": "https://www.neorotribe.com",
    "feed_url": "https://www.neorotribe.com/feed.json",
    "user_comment": "",
    "icon": "https://www.neorotribe.com/media/website/logo.png",
    "author": {
        "name": "June Ong"
    },
    "items": [
        {
            "id": "https://www.neorotribe.com/who-are-we.html",
            "url": "https://www.neorotribe.com/who-are-we.html",
            "title": "Who Are We",
            "summary": "We are Neorotribe. We are a tribe of 2 parents and 3 beautiful children. Our family name is Neo. You&hellip;",
            "content_html": "<p>We are Neorotribe. We are a tribe of 2 parents and 3 beautiful children. Our family name is Neo. You would have guessed by now.<br><br>Dad is Brandon. Mum is June. Follow by firstborn Liam who is beautiful, kind, unassuming and just so happens to have autism. Second-born Levi is sensitive, free-spirited and marked by his grandma's dimples. And lastly, the princess of our tribe Lily is endearing in every way. <br><br>We are from Singapore and have made Sydney Australia our home since 2016. The journey here has been amazing and challenging at the same time. We have been broken and healed, inundated by our experiences. Nonetheless, we would like to think there are also interesting and funny experiences that are worth sharing. We hoped you would be enriched and inspired by our stories.</p>\n<p>Don't be a stranger and say hello below.</p>",
            "image": "https://www.neorotribe.com/media/posts/7/110246741_1669651189865509_6728060733868684083_n.jpg",
            "author": {
                "name": "June Ong"
            },
            "tags": [
            ],
            "date_published": "2020-09-20T08:30:23+10:00",
            "date_modified": "2020-09-20T08:30:23+10:00"
        },
        {
            "id": "https://www.neorotribe.com/taronga-zoo.html",
            "url": "https://www.neorotribe.com/taronga-zoo.html",
            "title": "Taronga Zoo",
            "summary": "Everytime we visit Taronga Zoo, our experience is always different, in a good way. The view of the harbour would&hellip;",
            "content_html": "<p>Everytime we visit Taronga Zoo, our experience is always different, in a good way. The view of the harbour would almost always guarantee a mood lift. Today we got there around lunch time. Kids were excited as usual. They are pretty straight forward, they are happy when they get to go free range. </p>\n<p>I was just a little nervous when we saw the line to the seal show. It was a massive queue and there weren't much social distancing. We made our way against the traffic of people and made a beeline to the playground. I think any person that has gone to Taronga enough with food can tell you the resident turkeys there are relentless. They are really aggressive and no longer afraid of humans. The whole stress about guarding your children's food became like a chore really. We ended up force-feeding our children at double the speed while wary-eyed of the turkeys the whole time. I supposed tourists would find this fascinating and wouldn't mind the experience of kookaburras swopping down on your fish-and-chips or turkeys ransacking your snackbag. </p>\n<p>And a heads up, the usual main restaurant near the elephant enclosure is open for takeaway but not for sit down dining. BYOF. And maybe a red hot chilli and feed it to the turkey when it gets too annoying (I am kidding!). </p>\n<p>If you fancy a good exercise, you will work your glutes in the zoo walking up and down the slopes. It is especially intense on the way out to the exit. This is why I got my 9 yo Liam to push the stroller up today. Return of Investment. HA HA.</p>\n<p>I still think the zoo is a relatively safe place for a family day out in regards to the Covid situation. There are plenty of greens and spots for a sit down picnic. Some animals enclosures are pretty small and it does get a little crowded for my liking. But as parents it is on us to practice common sense and remind our kids about keeping their distance and maintaining their hygiene. </p>\n<p>Taronga Zoo also made provision for the autism community. Guests with autism and their family and friends get to enjoy early entry to the zoo on select days in the year. There is also an option of the zoo team providing extra assistance should there be a need. Read more <a href=\"https://www.neorotribe.com/taronga-zoo.html#INTERNAL_LINK#/post/null\" title=\"https://taronga.org.au/sydney-zoo/visitor-information/autism-services\">here</a>.</p>\n<p>Due to the current COVID-19 safety restrictions, all visitors are required to purchase tickets online (with up to 20% savings online!) and attend the Zoo on their selected date only. Tickets will not be available for purchase at the gate. If you plan to visit Taronga Zoo this season, you are advised to <a href=\"https://www.neorotribe.com/taronga-zoo.html#INTERNAL_LINK#/post/null\" title=\"https://au.openforms.com/Form/3dc5a1e9-a4f7-45f9-8153-ded980312be4\">book online</a> prior to attending. This is to prevent overcrowding and ensure social distancing measures can be effective. </p>\n<p>Enjoy your Taronga Zoo visit!</p>",
            "image": "https://www.neorotribe.com/media/posts/6/Taronga-2.jpg",
            "author": {
                "name": "June Ong"
            },
            "tags": [
            ],
            "date_published": "2020-09-20T08:30:23+10:00",
            "date_modified": "2020-09-20T08:30:23+10:00"
        },
        {
            "id": "https://www.neorotribe.com/review-hills-swimming.html",
            "url": "https://www.neorotribe.com/review-hills-swimming.html",
            "title": "Review: Hills Swimming",
            "summary": "Prior to moving to Hills district, I was concerned having to start all over finding our community. So far we&hellip;",
            "content_html": "<p>Prior to moving to Hills district, I was concerned having to start all over finding our community. So far we have been extremely surprised by the wide array of quality providers of kids' activities, cafes, parks, amenities and all. </p>\n<p>Swimming is a lifeskill so it is compulsory in our family. It was tricky for us to find the right one as Liam was having difficulties in a group swimming setting before. Our current challenge is to find a swimming place that can accommodate our 3 kids level and timing. </p>\n<p>We pulled the kids out of all their activities when the world came to an end in March (Feels like it in my part of the world!). </p>\n<p>At this unprecedented season, there is a certain sense of heightened cautiousness and fear when we send our kids back to their usual activities. My aim is to provide an insight on how well a place or provider is adhering to the covidsafe rules and regulations. This will provide you a peace of mind and let you know what to expect when you visit the place.</p>\n<p>Today marks the first time Lily is swimming. I was really impressed when we stepped into the vicinity. Entry and Exit were marked clearly at the door. You would hit the sanitiser station first and staff will take both yours and your child's temperature. You will then be directed to leave your details for contact tracing. The process was without dramas even though I had Lily with me. Perhaps it would be a different story with the boys.</p>\n<p>All the ground staffs were wearing masks and the swimming instructors in the pool were wearing a plastic shield. All the seatings were spaced out which is a relief. The pool do get a little crowded at some point but I do feel safe because I could smell the sanitiser in both seating and pool area. I must say the staffs has taken effort to be warm and engaging despite wearing the masks. </p>\n<p>It is really hard to be running a local business providing service at this Covid season. Everyone is trying their best to make it work. I do appreciate the fact that I can send my children in to continue their swimming activity in a safe and protected environment.</p>\n<p>For this I would give Hills Swimming a 5/5 rating as a covidsafe provider. This is on top of their excellent swimming curriculum which has stood the rest of time for many Hills district parents over the years.</p>\n<p>For more information on Hills Swimming, you can click <a href=\"https://www.neorotribe.com/review-hills-swimming.html#INTERNAL_LINK#/post/null\" title=\"https://www.hillsswimming.com/\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>. Begin your child's swimming journey by booking in a trial lesson <a href=\"https://www.neorotribe.com/review-hills-swimming.html#INTERNAL_LINK#/post/null\" title=\"https://www.hillsswimming.com/free-lessons.html\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.</p>",
            "image": "https://www.neorotribe.com/media/posts/5/Life_Floor_Hills_Swimming_2.jpg",
            "author": {
                "name": "June Ong"
            },
            "tags": [
            ],
            "date_published": "2020-09-20T08:30:23+10:00",
            "date_modified": "2020-09-20T08:30:23+10:00"
        },
        {
            "id": "https://www.neorotribe.com/authenticity-happiness.html",
            "url": "https://www.neorotribe.com/authenticity-happiness.html",
            "title": "Authenticity &#x3D; Happiness",
            "summary": "This year I gained a valuable piece of wisdom. I wanted to be happier, to be more present and to&hellip;",
            "content_html": "<p>This year I gained a valuable piece of wisdom. I wanted to be happier, to be more present and to be more authentic.</p>\n<p>You know as a parent you can get away with saying anything when your kids are young. They do not know any better nor judge you. Now that my kids are older, they would often retort back. \"Why do you say stupid, that is not nice\" or \"Why do you whinge when you ask me not to?\" You just can't have double standards anymore. </p>\n<p>And quitting the double standards actually inched me forward to be a more authentic and happier individual. There used to be a disparity in what I say and how I feel. It is probably a learnt behaviour growing up. I would say what I don't mean. I have mastered a skill of saying what people wants to hear. I have quit flattery so that was not an issue for me in recent times. </p>\n<p>Let me give you a scenario to illustrate my point better.</p>\n<p>Let's say I were to help a fellow friend with moving home. I appear to be willing and empathetic to my friend but complained about how tired it was to my husband after. I realised this disparity in between has caused me my happiness and my reliability with my children. So I decided to close this disparity gap for good.</p>\n<p>If I were to say something, I stay consistent in my word and thoughts. I quit being flippant or fickle. This has also helped me to stop overpromising and underdelivering in my life in general. I could write a thousand essays on this alone.</p>\n<p>Saying what you mean and meaning what you say happens to be the golden mantra of Brandon's too. He talks about it all the time with the kids. He is such an amazing human and the kids know he follow through what he promises each time. This is also why threatening our children never works and always end up backfiring on us. We all strive to be good reliable dependable parents to our children and one of the most important thing is to follow through our words, in punishment or in rewards. </p>\n<p>What words do you use? What would you say? Do you find that being authentic is to stay consistent to your words in front and behind the scenes?</p>",
            "image": "https://www.neorotribe.com/media/posts/4/_DSC4319.jpg",
            "author": {
                "name": "June Ong"
            },
            "tags": [
            ],
            "date_published": "2020-09-20T08:30:23+10:00",
            "date_modified": "2020-09-20T08:30:23+10:00"
        },
        {
            "id": "https://www.neorotribe.com/play.html",
            "url": "https://www.neorotribe.com/play.html",
            "title": "Play",
            "summary": "My kids love to play. Which kid doesn't? Unfortunately between play and having screen time, they would gladly choose the&hellip;",
            "content_html": "<p>My kids love to play. Which kid doesn't? Unfortunately between play and having screen time, they would gladly choose the latter. </p>\n<p>This is why Brandon and I are huge advocates at providing the environment for them to play. We are not big on accumulating toys and are minimalists by nature. So at any one time in the house, there is only a set of toy and activity. At this moment it's LEGO. We would never say no to books so they are everywhere in our home. </p>\n<p>We are very fortunate to have a yard in our home. The trampoline has been a daily routine for my kids. We recently added a cubby because the kids had bugged us for the past year for a treehouse. We don't have a tree and the cubby is the next best thing. We chose a big cubby as Liam could not fit into a toddler's one anymore. We hoped it would serve as a hideout and probably even a kiddy flat for them. </p>\n<p>My kids understand the drill in the house. They would usually get out and play themselves. Unless there is a fight incident among them, they can go on for hours. I have also trained myself to resist helping them with their boredom. I have never gave in to them when they come to me and say they are bored. They have a million things to do if they dig deep into their imagination. And usually after some time, they would find something to do. </p>\n<p>It takes practice for both you and your children to get into the routine. I never like placing my kids in front of a TV. They are losing precious time with each other bonding and making memories. I let them get dirty and messy in the yard. There is so much the great outdoors could offer to both the kids and adults. </p>\n<p>This is why I love being in the garden, working the lawn or caring for the plants. It does my soul so so good. My kids are also much calmer when they get to play in the sun and get some fresh air.</p>\n<p>Rewild and rewire yourself with your own family culture. It is a little tweak but it would bring so much happiness in the long run. Try it.</p>",
            "image": "https://www.neorotribe.com/media/posts/3/_DSC4415.jpg",
            "author": {
                "name": "June Ong"
            },
            "tags": [
            ],
            "date_published": "2020-09-20T08:30:23+10:00",
            "date_modified": "2020-09-20T08:30:23+10:00"
        },
        {
            "id": "https://www.neorotribe.com/lets-rewild-ourselves.html",
            "url": "https://www.neorotribe.com/lets-rewild-ourselves.html",
            "title": "Let&#x27;s Rewild Ourselves",
            "summary": "I was a typical Singaporean. I was a city girl. I love efficiency, cleanliness, structure, and on. With all these&hellip;",
            "content_html": "<p><span data-preserver-spaces=\"true\">I was a typical Singaporean. I was a city girl. I love efficiency, cleanliness, structure, and on. With all these expectations came a certain level of obnoxiousness. I expected much of myself and everyone. It was a straightforward equation in life for me; if you grow apple seeds, you reap apple fruits out of an apple tree. </span></p>\n<p><em><span data-preserver-spaces=\"true\">If only life was that simple. </span></em></p>\n<p><span data-preserver-spaces=\"true\">I thought hard and long on why we are and who we are now. Then I realised our kids made us. I say it all the time, my kids do not belong to an orderly civilisation. They are just wild. They need space, stimulation, walls to bounce off from and to be occupied with things to do. They get bored easily, their minds are like deep recesses created to suck every ounce of energy and blood of their caretakers. Please don't be mistaken, they are great kids. They just need their sufficient fill of exploration and learning daily. </span></p>\n<p><span data-preserver-spaces=\"true\">If we suppressed their need for exploration with screen time, they become restless and agitated. Liam had unrestricted access to the iPad last summer holidays and I wouldn't even go into detail the aftermath of it. (Well, I actually did in an <a href=\"https://www.neorotribe.com/theres-no-tv-in-our-home.html\" target=\"_blank\" rel=\"noopener noreferrer\">previous post.</a>) Let's just say we lost a child. He was disengaged and uninterested with life because he was overstimulated. </span></p>\n<p><span data-preserver-spaces=\"true\">And so Brandon and I resigned to the fact that we had to go on a rewild and rewire journey as a family. We haven't had a TV for the past 5 years. We have no iPad for the past year. That said, the children do have access to movies on the laptop during the weekends or when we have visitors. I am not selling our way of living; we just had to do it because that was the best way for us. But I have to say every family can look into regulating their children's access to technology and internet. It is worth talking about it, fighting against the norm and working it out as a family. </span></p>\n<p><span data-preserver-spaces=\"true\">Tell me your thoughts and struggles below. I am all ears!</span></p>",
            "image": "https://www.neorotribe.com/media/posts/2/_DSC4305.jpg",
            "author": {
                "name": "June Ong"
            },
            "tags": [
            ],
            "date_published": "2020-09-20T08:30:23+10:00",
            "date_modified": "2020-09-20T08:30:23+10:00"
        },
        {
            "id": "https://www.neorotribe.com/theres-no-tv-in-our-home.html",
            "url": "https://www.neorotribe.com/theres-no-tv-in-our-home.html",
            "title": "There&#x27;s no TV in our home",
            "summary": "I would like to clarify I don't hate technology. But I am still learning how to hone it. Technology is&hellip;",
            "content_html": "<p>I would like to clarify I don't hate technology. But I am still learning how to hone it. Technology is like the infinity gauntlet with the stones (shoutout to Marvel fans), if you misuse it there will be consequences. <br><br>Back in 2012, Liam was a 2-year-old toddler. He was beyond fixated on the TV. When he was finally diagnosed with GDD (Global Developmental Delay), we were questioning if the overdose of screen time has led to the delays of all his skills. When we came to Sydney in 2016, we were exhausted in all forms. Having to deal with Liam's new diagnosis of autism and seeking to find a roadmap out of it. When we move into our first home here, we decided not to get a TV in the house. We were yearning for a change, we wanted to do more for our kids rather than propping them in front of the 'devils box'. <br><br>It was not a complete obsolete from screen time or technology in our household for the past few years. We still allow limited time of movies on the laptop from time to time. <br>But the whole conviction of pushing technology out of our system arose within the end of last year. The straw the broke the camel's back. Over the holidays, Liam had unlimited access to the games on the iPad. He finds comfort in the games he played because they are controlled regulated worlds. He was addicted to the stimulation and was unable to manage it for obvious reasons. He was angry, agitated and definitely disconnected. I knew that I had lost him and something drastic has to be done. <br>We got rid of the 3 iPads at the end of the holidays. We put Liam on a cold turkey. Initially, he was disengaged from his siblings and was extremely upset at us. Constantly lying by the side of the playground, feeling lethargic and irritated. Activities that he used to enjoy like reading books or playing in the back were no longer stimulating enough for him. It was a dark week for all of us.  I remembered telling Brandon if he ever brings back an iPad into the house again, I will not hesitate to set it on fire.<br><br>Do I hate technology? No. It is just so happens in our case, we have to thread carefully. Before our kids have mastered the ability of self-control, we are in control of their access. We know that in time to come, they will dive into them with no return. So as long and as much possible, we want quality time with them. </p>",
            "image": "https://www.neorotribe.com/media/posts/1/_DSC4534.jpg",
            "author": {
                "name": "June Ong"
            },
            "tags": [
            ],
            "date_published": "2020-09-20T08:30:23+10:00",
            "date_modified": "2020-09-20T08:30:23+10:00"
        }
    ]
}
